schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
    // Per-cell arrays (20 voltages, 7 temperatures; null if not yet received).
    // Emitted in the minimal/BLE payload too so the cell-detail view works over
    // Bluetooth as well as WiFi; costs ~200 B (a couple more BLE chunks).
    {
        auto cells = cells_obj["voltages"].to<JsonArray>();
        for (int i = 0; i < NUM_CELLS; i++) {
            if (!isnan(g_cell_v[i]))
                cells.add(roundf(g_cell_v[i] * 1000.0f) / 1000.0f);
            else
                cells.add(nullptr);
        }
        auto temps = cells_obj["temp_readings"].to<JsonArray>();
        for (int i = 0; i < NUM_TEMPS; i++) {
            if (!isnan(g_temp_c[i]))
                temps.add((int)g_temp_c[i]);
            else
                temps.add(nullptr);
        }
    }

    // BMS state
    if (g_bms_state.valid) {
        auto st = doc["bms"]["state"].to<JsonObject>();
        if (!minimal) {
            st["byte0"] = g_bms_state.byte0;
            st["byte1"] = g_bms_state.byte1;
        }
        st["output_enable"]  = g_bms_state.output_enable  ? 1 : 0;
        st["main_contactor"] = g_bms_state.main_contactor ? 1 : 0;
        st["operating"]      = g_bms_state.operating      ? 1 : 0;
        st["precharge"]      = g_bms_state.standby        ? 1 : 0;
        st["charging"]       = g_bms_state.charging       ? 1 : 0;
        st["no_drive"]       = g_bms_state.no_drive       ? 1 : 0;
        st["drive_mode"]     = g_bms_state.drive_mode     ? 1 : 0;
        st["awake"]          = g_bms_state.awake          ? 1 : 0;
    }

    // BMS current limits
    if (g_bms_limit.valid) {
        auto lim = doc["bms"]["limit"].to<JsonObject>();
        addFloat(lim, "discharge_a", g_bms_limit.discharge_a, 2);
        addFloat(lim, "charge_a",    g_bms_limit.charge_a,    2);
        addFloat(lim, "charge_power_extra_w", g_bms_limit.charge_power_extra_w, 0);
        if (!minimal) {
            lim["mode"]  = g_bms_limit.mode;
            lim["byte5"] = g_bms_limit.byte5;
        }
    }

    // Combined fault codes (BMS + Motor Controller)
    auto faults = doc["faults"].to<JsonObject>();
    auto bms_codes = faults["bms"].to<JsonArray>();
    if (g_bms_faults.any_fault) {
        for (int code = 100; code <= 145; code++) {
            if (g_bms_faults.active_codes_mask & (1ULL << (code - 100)))
                bms_codes.add(code);
        }
    }
    auto mc_codes = faults["mc"].to<JsonArray>();
    if (g_dm1.valid && g_dm1.dtc_spn != 0)
        mc_codes.add(g_dm1.dtc_spn);

    // Motor — always emit so motor.alive is the canonical tractor-on signal.
    // FF21CA broadcasts at ~85 Hz; the MC stops within ~1s of key-off. The
    // 500 ms window catches brief key cycles without false-positiving on a
    // single dropped frame. last_seen_ms==0 means FF21CA has never been
    // heard in this boot — explicitly false rather than relying on a
    // millis()-rollover-from-zero accident.
    {
        auto mot = doc["motor"].to<JsonObject>();
        mot["alive"] = g_motor.last_seen_ms != 0
                       && (millis() - g_motor.last_seen_ms) < 500;
        if (g_motor.valid) {
            if (!minimal) mot["rpm_signed"] = g_motor.rpm_signed;
            mot["rpm_magnitude"] = g_motor.rpm_magnitude;
            mot["direction"]     = g_motor.direction;
            mot["range"]    = g_motor.range;
            mot["torque_raw"] = g_motor.torque_raw;
            // Ground speed from RPM × range (Turf/Industrial tire calibration,
            // per Operator Manual p34; Agri tires would need different coeffs).
            if (g_motor.range >= 1 && g_motor.range <= 3) {
                static const float KMH_PER_RPM[3] = {
                    5.7f / 2800.0f, 8.6f / 2800.0f, 17.0f / 2800.0f
                };
                float kmh = g_motor.rpm_magnitude * KMH_PER_RPM[g_motor.range - 1];
                addFloat(mot, "speed_kmh", kmh, 2);
                addFloat(mot, "speed_mph", kmh * 0.6213712f, 2);
            }
            if (g_motor.controller_temp_c != INT8_MIN)
                mot["controller_temp_c"] = g_motor.controller_temp_c;
            if (g_motor.motor_temp_c != INT8_MIN)
                mot["motor_temp_c"] = g_motor.motor_temp_c;
        }
    }

    {
        uint32_t nowms = millis();
        bool mc_alive = g_motor.last_seen_ms != 0
                        && (nowms - g_motor.last_seen_ms) < 500;
        doc["tractor"] = mc_alive ? "on" : "off";
    }

#if defined(HAS_VIN_SENSE)
    if (!isnan(g_vin_v)) {
        doc["vin_v"] = roundf(g_vin_v * 10.0f) / 10.0f;
    }
#endif

    // Charger
    if (g_charger.valid) {
        auto chg = doc["charger"].to<JsonObject>();
        chg["flags"] = g_charger.flags;
        if (!minimal) {
            chg["v_raw"]  = g_charger.v_raw;
            chg["i_raw"]  = g_charger.i_raw;
        }
        addFloat(chg, "voltage_v", g_charger.voltage_v, 2);
        addFloat(chg, "current_a", g_charger.current_a, 1);
    }

    // BMS→charger command
    if (g_chgr_cmd.valid) {
        auto cmd = doc["chgr_cmd"].to<JsonObject>();
        if (!minimal) cmd["enable"] = g_chgr_cmd.enable;
        addFloat(cmd, "voltage_v", g_chgr_cmd.voltage_v, 1);
        addFloat(cmd, "current_a", g_chgr_cmd.current_a, 1);
        if (!minimal && g_chgr_cmd.v_raw) cmd["v_raw"] = g_chgr_cmd.v_raw;
        if (!minimal && g_chgr_cmd.i_raw) cmd["i_raw"] = g_chgr_cmd.i_raw;
    }

    if (!minimal) {
        // Vehicle controller
        if (g_vc_state != 0xFF)
            doc["vc"]["state"] = g_vc_state;

        // Dashboard
        if (g_dash_alive != 0xFF)
            doc["dash"]["alive"] = g_dash_alive;

        // DM1 (raw FMI/OC/CM and lamp bytes — fault code is also in faults.mc)
        if (g_dm1.valid) {
            auto dm1 = doc["dm1"].to<JsonObject>();
            dm1["lamp_byte0"] = g_dm1.lamp_byte0;
            dm1["lamp_byte1"] = g_dm1.lamp_byte1;
            dm1["dtc_spn"]    = g_dm1.dtc_spn;
            dm1["dtc_fmi"]    = g_dm1.dtc_fmi;
            dm1["dtc_cm"]     = g_dm1.dtc_cm;
            dm1["dtc_oc"]     = g_dm1.dtc_oc;
        }
    }

    String out;
    if (pretty) serializeJsonPretty(doc, out);
    else        serializeJson(doc, out);
    return out;
}

