schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
void socketcandPoll() {
    WiFiClient new_client = socketcand_server.available();
    if (new_client) {
        int free_idx = -1;
        for (int i = 0; i < SOCKETCAND_NUM_CHANNELS; i++) {
            if (socketcand_slots[i].state == SC_DISCONNECTED) { free_idx = i; break; }
        }
        if (free_idx >= 0) {
            SocketcandSlot& slot = socketcand_slots[free_idx];
            slot.client  = new_client;
            slot.client.setNoDelay(true);
            slot.client.print("< hi >");
            slot.state   = SC_WAITING_OPEN;
            slot.len     = 0;
            slot.channel = -1;
        } else {
            new_client.stop();   // pool full — keep the existing clients
        }
    }
    for (auto& slot : socketcand_slots) {
        if (slot.state != SC_DISCONNECTED && !slot.client.connected()) {
            slot.client.stop();
            slot.state   = SC_DISCONNECTED;
            slot.len     = 0;
            slot.channel = -1;
        }
        while (slot.client && slot.client.available()) {
            char c = slot.client.read();
            if (c == '<') {
                slot.len = 0;
                slot.buf[slot.len++] = c;
            } else if (slot.len > 0 && slot.len < sizeof(slot.buf) - 1) {
                slot.buf[slot.len++] = c;
                if (c == '>') {
                    slot.buf[slot.len] = '\0';
                    socketcandHandleCommand(slot, slot.buf);
                    slot.len = 0;
                }
            }
        }
    }
}

// ── BLE (Nordic UART Service) ─────────────────────────────────────────────────
// Pushes a compact (minimal) JSON snapshot to a single BLE central whenever it
// differs from what we last sent. Framing on the wire is:
//
//     [u16 big-endian length] [length bytes of JSON]
//
// sent across N notifications of up to BLE_CHUNK_BYTES each. The Android
// client reassembles by counting bytes against the length prefix. Connection
// is unpaired — anyone in range with the NUS UUID can subscribe.
//
// MTU: we request 517 server-side; the actual MTU is whatever the client
// negotiates. BLE_CHUNK_BYTES is conservative so a default-MTU client (23)
// would still receive valid (if smaller) packets — but the Android app calls
// requestMtu(517) on connect.
//
// RX characteristic is exposed for future command/control (e.g. reset session
// counters); currently writes are accepted and ignored.

#define NUS_SVC_UUID  "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"
#define NUS_TX_UUID   "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"
#define NUS_RX_UUID   "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"

#define BLE_CHUNK_BYTES        180
#define BLE_PUSH_INTERVAL_MS   200    // diff cadence — actual send only on change
#define BLE_INTER_CHUNK_DELAY  5

static BLEServer*         g_ble_server = nullptr;
static BLECharacteristic* g_ble_tx     = nullptr;
static volatile bool      g_ble_connected = false;
static String             g_ble_last_payload;
static uint32_t           g_ble_last_push_ms = 0;

class BleServerCb : public BLEServerCallbacks {
    void onConnect(BLEServer*) override {
        g_ble_connected   = true;
        g_ble_last_payload = "";   // force a full resend on (re)connect
    }
    void onDisconnect(BLEServer* s) override {
        g_ble_connected   = false;
        g_ble_last_payload = "";
        s->getAdvertising()->start();   // resume advertising for the next client
    }
};

void bleInit() {
    BLEDevice::init("tractor");
    BLEDevice::setMTU(517);

    g_ble_server = BLEDevice::createServer();
    g_ble_server->setCallbacks(new BleServerCb());

    BLEService* svc = g_ble_server->createService(NUS_SVC_UUID);
    g_ble_tx = svc->createCharacteristic(NUS_TX_UUID, BLECharacteristic::PROPERTY_NOTIFY);
    g_ble_tx->addDescriptor(new BLE2902());
    svc->createCharacteristic(NUS_RX_UUID,
        BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_WRITE_NR);
    svc->start();

    BLEAdvertising* adv = BLEDevice::getAdvertising();
    adv->addServiceUUID(NUS_SVC_UUID);
    adv->setScanResponse(true);
    BLEDevice::startAdvertising();
}

static void bleSendFramed(const String& payload) {
    if (!g_ble_connected || !g_ble_tx) return;
    size_t total = payload.length();
    if (total > 65535) return;

    // 8 KB scratch is plenty: minimal JSON for this dashboard runs ~800 B
    // (incl. the per-cell voltage/temperature arrays).
    static uint8_t buf[2 + 8192];
    size_t framed = 2 + total;
    if (framed > sizeof(buf)) return;
    buf[0] = (uint8_t)((total >> 8) & 0xFF);
    buf[1] = (uint8_t)(total & 0xFF);
    memcpy(buf + 2, payload.c_str(), total);

    size_t off = 0;
    while (off < framed) {
        size_t n = framed - off;
        if (n > BLE_CHUNK_BYTES) n = BLE_CHUNK_BYTES;
        g_ble_tx->setValue(buf + off, n);
        g_ble_tx->notify();
        off += n;
        if (off < framed) delay(BLE_INTER_CHUNK_DELAY);
    }
}

void bleTick() {
    if (!g_ble_connected) return;
    uint32_t now = millis();
    if (now - g_ble_last_push_ms < BLE_PUSH_INTERVAL_MS) return;
    g_ble_last_push_ms = now;

    String j = buildJson(false /*pretty*/, true /*minimal*/);
    if (j != g_ble_last_payload) {
        bleSendFramed(j);
        g_ble_last_payload = j;
    }
}

// ── Setup & loop ──────────────────────────────────────────────────────────────

void setup() {
    Serial.begin(115200);

    ledInit();
    ledWrite(4, 4, 4);   // dim white the moment firmware starts running

#if defined(BOARD_REJSACAN)
    // Drive the transceiver into high-speed normal mode (RS=LOW) and assert
    // the auto-shutdown override so the board stays on across vehicle/key
    // cycles. Both must happen before the TWAI driver starts — otherwise the
    // bus floats and the first frames after boot are lost.
    pinMode(CAN_RS_PIN, OUTPUT);
    digitalWrite(CAN_RS_PIN, LOW);
    pinMode(FORCE_ON_PIN, OUTPUT);
    digitalWrite(FORCE_ON_PIN, HIGH);
#endif

    for (int i = 0; i < NUM_CELLS; i++) g_cell_v[i] = NAN;
    for (int i = 0; i < NUM_TEMPS; i++) g_temp_c[i] = NAN;

