schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
    // CAN at 250 kbit/s (J1939 standard). Default rx_queue_len is 5, which
    // overflows when server.handleClient() blocks the loop building JSON.
    // 128 gives ~0.5 s of buffer at full bus utilisation.
    //
    // Build with -DCAN_LISTEN_ONLY to put the controller in listen-only mode:
    // it never transmits — no ACKs, no error frames — so it is electrically
    // incapable of perturbing other nodes. Use this when tapping a bus shared
    // with a device you must not disturb (e.g. a fleet/compliance logger).
    // Trade-off: ALL transmit is disabled (SLCAN injection, socketcand
    // client->bus send, UDS polling). Default is NORMAL, which ACKs frames.
#if defined(CAN_LISTEN_ONLY)
    const twai_mode_t kCanMode = TWAI_MODE_LISTEN_ONLY;
#else
    const twai_mode_t kCanMode = TWAI_MODE_NORMAL;
#endif
    twai_general_config_t can_cfg = TWAI_GENERAL_CONFIG_DEFAULT(
        CAN_TX_PIN, CAN_RX_PIN, kCanMode);
    can_cfg.rx_queue_len = 128;
    can_cfg.tx_queue_len = 32;
    twai_timing_config_t  tim_cfg = TWAI_TIMING_CONFIG_250KBITS();
    twai_filter_config_t  flt_cfg = TWAI_FILTER_CONFIG_ACCEPT_ALL();
    esp_err_t err = twai_driver_install(&can_cfg, &tim_cfg, &flt_cfg);
    if (err == ESP_OK) {
        err = twai_start();
        if (err == ESP_OK) g_can_initialized = true;
    }

    // Bring up the soft-AP first so the board is always reachable in the field
    // at 192.168.4.1 even if there's no home network in range. STA connect
    // happens in the background; we don't block boot waiting on it.
    //
    // Only enable the station when a home network is actually configured. The
    // AP and STA share one radio: if WIFI_SSID is empty the station would scan
    // every channel forever looking for a network that doesn't exist, which
    // makes the soft-AP beacon hop channels and drop out (it appears briefly
    // then vanishes and won't accept clients). Build with an empty WIFI_SSID
    // for a rock-solid AP-only setup; set it to join a bench network as before.
    const bool join_sta = (sizeof(WIFI_SSID) > 1);
    WiFi.mode(join_sta ? WIFI_AP_STA : WIFI_AP);
    g_ap_running = WiFi.softAP(AP_SSID, AP_PASS);
    if (join_sta) WiFi.begin(WIFI_SSID, WIFI_PASS);

    // Wildcard DNS on the soft-AP: any hostname (tractor.local, tractor,
    // captive-portal probes, etc.) resolves to the board's AP IP. Needed
    // because phones generally don't do mDNS over an AP with no internet.
    if (g_ap_running) dns_server.start(53, "*", WiFi.softAPIP());

    MDNS.begin(MDNS_NAME);

    server.on("/",     handleRoot);
    server.on("/json", handleJson);
    server.begin();
    MDNS.addService("http", "tcp", 80);

    socketcand_server.begin();
    socketcand_server.setNoDelay(true);
    MDNS.addService("socketcand", "tcp", SOCKETCAND_PORT);

#if defined(HAS_MCP2515)
    // Release the MCP2515 from hardware reset before any SPI traffic. RESET is
    // active-low; pulse it low then high and let the oscillator settle. Without
    // this the chip stays held in reset and begin() returns kNoMCP2515.
    pinMode(MCP2515_RST_PIN, OUTPUT);
    digitalWrite(MCP2515_RST_PIN, LOW);
    delay(10);
    digitalWrite(MCP2515_RST_PIN, HIGH);
    delay(10);

    // Do NOT pass the CS pin to SPI.begin — Arduino-ESP32 would attach it as
    // hardware-SS and fight the library's software-CS control. The ACAN2515
    // library drives CS itself (it calls pinMode(CS, OUTPUT) in begin()).
    SPI.begin(MCP2515_SCK_PIN, MCP2515_MISO_PIN, MCP2515_MOSI_PIN);

    // ACAN2515Settings(quartz_Hz, bitrate). begin() issues the MCP2515 reset,
    // configures bit timing, installs the ISR, and returns 0 on success (a
    // non-zero code is a bitmask of configuration errors — e.g. an impossible
    // bitrate for the given crystal). Default mode is NormalMode (2.0B); the
    // default filters accept every frame, which is what we want for a sniffer.
    ACAN2515Settings mcp_cfg(MCP2515_QUARTZ_HZ, 250UL * 1000UL);
    g_mcp_init_err    = g_mcp.begin(mcp_cfg, [] { g_mcp.isr(); });
    g_mcp_initialized = (g_mcp_init_err == 0);
#endif

    bleInit();
}

void loop() {
    twai_message_t msg;
    while (twai_receive(&msg, 0) == ESP_OK) {
        if (msg.extd) {
            decodeCAN(msg.identifier, msg.data, msg.data_length_code);
            slcanSendFrame(msg);
            socketcandSendFrame(msg, /*channel=*/0);
        }
    }
#if defined(HAS_MCP2515)
    if (g_mcp_initialized) {
        CANMessage frame;
        while (g_mcp.receive(frame)) {
            g_mcp_frames_rx++;
            twai_message_t fwd = {};
            fwd.identifier       = frame.id;
            fwd.extd             = frame.ext ? 1 : 0;
            fwd.data_length_code = frame.len <= 8 ? frame.len : 8;
            memcpy(fwd.data, frame.data, fwd.data_length_code);
            socketcandSendFrame(fwd, /*channel=*/1);
        }
    }
#endif
    slcanPoll();
    socketcandPoll();
    dns_server.processNextRequest();
    server.handleClient();
    bleTick();
    updateLed();
#if defined(HAS_VIN_SENSE)
    updateVinSense();
#endif
}
